package by.epam.grodno.uladzimir_stsiatsko.java.se02_1;

public class Spec {
	
	private String text = "Спецификация класса Pen (ручка) \n"
			+ "Поля: \n"
			+ " - Ручка должна иметь цену \n"
			+ " - Ручка должна иметь стержень \n"
			+ " - Ручка может быть включенной или выключенной \n"
			+ " - Ручка может быть сломанной или рабочей \n"
			+ "Методы: \n"
			+ " - Ручка должна уметь писать \n"
			+ " - Ручка должна включаться и выключаться \n"
			+ " - Стержень ручки должен заканчиваться \n"
			+ " - Стержень ручки должен заменяться \n"
			+ " - Ручка должна ломаться после длительного использования \n";
			
		
	public String getText(){
		return text;
	}
	
}
